app/views/articles/index.html.erb

                        <span class="w3-padding-large w3-right"><b>Comments  </b>
                        <span class="w3-tag"><%= article.comments.length %></span></span>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 2]]

          <p>
            <% Tag.all.each do |tag| %>
---
SELECT "tags".* FROM "tags"