app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY view_cont DESC
---
    def index
        @articles = Article.all

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "articles" SET "view_cont" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["view_cont", 1], ["updated_at", "2020-01-30 23:04:13.009417"], ["id", 2]]
UPDATE "articles" SET "view_cont" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["view_cont", 3], ["updated_at", "2020-01-30 23:05:38.443823"], ["id", 2]]
---
    def show
        @article = Article.find(params[:id])
        @article.increment_view_count
        @article.save

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "view_cont") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["body", "testtest"], ["created_at", "2020-01-30 23:14:24.079072"], ["updated_at", "2020-01-30 23:14:24.079072"], ["view_cont", 0]]
---
    def create
        @article = Article.new(article_params)
        @article.save